# 有向グラフ
# graph_1を改良
data = [
    [0,1,1,0,0],
    [0,0,1,1,0],
    [0,0,0,0,0],
    [0,0,0,0,1],
    [0,0,1,1,0],
]

node = ["(0)","(1)","(2)","(3)","(4)"]

arrow = ["","-->","<--","<->"] # エッジの向きを定義

for y in range(5):
    for x in range(y,5):
        e1 = data[y][x] # y -> x
        e2 = data[x][y] # x -> y
        a = e1 + e2*2 
        # a = 1なら <-
        # a = 2なら ->
        # a = 3なら <->
        if a > 0:
            print(node[y] + arrow[a] + node[x])
"""
練習問題
1.a=3,b=1
2.1=最初,2=FIFO
3.1=A,2=D
4.1=3,2=None,3=6
5.c
"""